AcDbSubentRef.setFromSubentPath(AcDbFullSubentPath!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Sets mEntity and mSubentId data members.

AcDbSubentRef.setSubent(AcDbSubentId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Sets mSubentId data member.

AcDbSubentRef.setEntity(AcDbCompoundObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Sets mEntity data member.

AcDbSubentRef.evaluateAndCacheGeometry
No cached constant geoemtry held in AcDbSubentRef base class.

AcDbSubentRef.createEntity
Creates an AcDbEntity from the subentity of the entity.

AcDbSubentRef.subentId
Returns the AcDbSubentId in an AcDbEntity that the AcDbSubentRef references.
May be null if whole AcDbEntity is referenced.

AcDbSubentRef.entity
Returns the AcDbCompoundObjectId of the entity that the AcDbSubentRef references.
May be empty if a derived class holds constant geometry and does not
reference any existing AcDbEntity.

AcDbSubentRef.#ctor(AcDbCompoundObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcDbSubentId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
The constructor sets data members of the AcDbSubentRef.

AcDbSubentRef.#ctor
Default constructor.

AcDbSubentRef
Base class for AcDbFaceRef, AcDbEdgeRef and AcDbVertexRef. It keeps an
AcDbCompoundObjectId of an AcDbEntity and AcDbSubentId of a subentity of
this entity.